projekt/app/controllers/artifacts_controller.rb

  def download
    artifact = Artifact.find(params[:id])
---
SELECT "artifacts".* FROM "artifacts" WHERE "artifacts"."id" = 5 LIMIT 1

  def show
    @artifact = Artifact.find(params[:id])
---
SELECT "artifacts".* FROM "artifacts" WHERE "artifacts"."id" = 7 LIMIT 1

  def create
    @folder = Folder.find(params[:artifact][:folder_id])
    uuid = SecureRandom.uuid
    uploaded_file = params[:artifact][:file]
    local_file_path = "#{ENV.fetch("LOCAL_FILE_LOCATION")}/#{uuid}#{uploaded_file.original_filename}"
    @artifact = Artifact.new(
      name: params[:artifact][:name],
      content_type: uploaded_file.content_type,
      storage_key: local_file_path,
      user_id: current_user.id,
      folder_id: params[:artifact][:folder_id],
      size: uploaded_file.size,
      original_filename: uploaded_file.original_filename

      )
    if @artifact.save
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 15 LIMIT 1
INSERT INTO "artifacts" ("name", "content_type", "size", "user_id", "folder_id", "storage_key", "checksum", "created_at", "updated_at", "original_filename") VALUES ('t_e_s_t', 'image/png', 1206802, 1, 15, '/var/lib/lightarti/storage/79a0a7b0-b67d-4196-9d01-fc568369f8c9durup logo.png', NULL, '2026-06-18 10:31:25.516168', '2026-06-18 10:31:25.516168', 'durup logo.png') RETURNING "id"

  def destroy
    @artifact = Artifact.find(params[:id])
    if File.exist?(@artifact.storage_key)
      File.delete(@artifact.storage_key)
    end
    @artifact.destroy
---
SELECT "artifacts".* FROM "artifacts" WHERE "artifacts"."id" = 4 LIMIT 1
DELETE FROM "artifacts" WHERE "artifacts"."id" = 4