projekt/app/controllers/folders_controller.rb

  def index
    puts "muhahahaha"
    if current_user
      @folders = current_user.folders.where(parent_id: nil).sort_by(&:name)
---
SELECT "folders".* FROM "folders" INNER JOIN "folder_permissions" ON "folders"."id" = "folder_permissions"."folder_id" WHERE "folder_permissions"."user_id" = 1 AND "folders"."parent_id" IS NULL

  def destroy
    @folder = Folder.find(params[:id])
    @folder.destroy!
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 15 LIMIT 1
DELETE FROM "folders" WHERE "folders"."id" = 30

  def create
    @folder = Folder.new(folder_params)
    if @folder.save
      @folder.folder_permissions.create!(user: current_user, role: "admin")
      if @folder.parent
        @dom_folder = @folder.parent
        @folder_open = params[:folder][:folder_open]
      else
        @root_folder = true
        @folders = current_user.folders.where(parent_id: nil).sort_by(&:name)
---
INSERT INTO "folders" ("name", "parent_id", "created_at", "updated_at") VALUES ('test_folder', NULL, '2026-06-18 18:38:57.885297', '2026-06-18 18:38:57.885297') RETURNING "id"
INSERT INTO "folder_permissions" ("folder_id", "user_id", "role", "created_at", "updated_at") VALUES (34, 1, 'admin', '2026-06-18 18:38:57.898670', '2026-06-18 18:38:57.898670') RETURNING "id"
SELECT "folders".* FROM "folders" WHERE "folders"."parent_id" = 15

  def new
    @folder = Folder.new
    @parent = Folder.find(params[:parent_id]) if params[:parent_id]
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 15 LIMIT 1

  def show
    @folder = Folder.find(params[:id])
    @rootfolder = @folder.parent_id.nil?
    @sub_folders = @folder.children.sort_by(&:name)
    @artifacts = Artifact.where(folder_id: @folder.id)
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 34 LIMIT 1
SELECT "artifacts".* FROM "artifacts" WHERE "artifacts"."folder_id" = 15

  def close
    @folder = Folder.find(params[:id])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 15 LIMIT 1