projekt/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at") VALUES ('krixzy', '$2a$12$ZjPhEpV5AANfTaVz13uYFeh0F9w49JWJ5NtHBmChbsDxSYv7Unmge', '2026-06-12 08:42:46.807928', '2026-06-12 08:42:46.807928') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save